"""
git --version
git --help

git init - створюється репозиторій лише один раз для 1 проєкту/
            робимо в будь-якому місці біля потрібного файлу, або по теці проєкту

git status - для контролю нашого статусу нашого репозиторія,
            On branch - гілка, master - імя головної гілки в гіті.
              в такому випадку ми в головній гілці гіта

            можна відійти від гілки мастер, скопіювати дані і працювати в іншій гілці
            із новою варіацією.
            untrackef foles - файли не під версіонним контролем.

git add -A  - ми оберемо усі файли у теці та у її підтеках
        --all

    commit - (версія)
































"""











