"""
GIT BUSH HERE - робимо в будь-якому місці біля потрібного файлу, або по теці проєкту

git --version - - показує поточну версію встановленої програми GIT
git --help    - - показує усі поточні команди які є у GIT

git init - створюється репозиторій лише один раз для 1 проєкту (проєкт - поточна тека у котрій працюємо)/
            - утвориться файл init

git status - для контролю нашого статусу нашого репозиторія,
            On branch - гілка, master - імя головної гілки в гіті.
              в такому випадку ми в головній гілці гіта

            можна відійти від гілки мастер, скопіювати дані і працювати в іншій гілці
            із новою варіацією.
            untracked files - файли не під версіонним контролем

git add -A          -ми оберемо усі файли у теці та у її підтеках(Нічого не буде показано)
                                /можна перевірити git status
        (--all)
        *****.py    - імя нашого файлу якщо ми хочемо додати один файл
        .           -обере усі файли що є у папці але без вкладених тек

git commit -m "імя поточного коміту"   -  (версія) контрольна точка яка нам
                                           необхідна
































"""











